Sandgreenpanda/2026-ESP32/src/main.cpp
#include "Arduino.h"
#include "HardwareSerial.h"
#include "WString.h"
#include "esp32-hal-ledc.h"
#include "esp32-hal.h"
#include "esp_task_wdt.h"
#include "libssh_esp32.h"
#include "mbedtls/sha256.h"
#include <FS.h>
#include <HTTPRequest.hpp>
#include <HTTPResponse.hpp>
#include <HTTPSServer.hpp>
#include <SD.h>
#include <SPI.h>
#include <SSLCert.hpp>
#include <URLCode.h>
#include <WiFi.h>
#include <WiFiMulti.h>
#include <bits/stdc++.h>
#include <functional>
#include <keyValueDatabase.hpp>
#include <libssh/libssh.h>
#include <lwip/sockets.h>
#include <sha/sha_parallel_engine.h>
#include <ssh_functions.h>
#include <utility>
#include <vector>
#define SD_MISO 16
#define SD_SCK 17
#define SD_MOSI 18
#define SD_CS 19

#define LAPTOP_HP_1 33
#define LAPTOP_HP_2 32
#define LAPTOP_HP_3 12
#define LAPTOP_LENOVO_1 27
#define LAPTOP_ACER_1 26
#define LAPTOP_ACER_2 25

#define PWM_FAN_1 23
#define TACH_FAN_1 22

// Max ssh clients. So fat this is for 6 computers, so I may do different objs later.
// For now four is more than enough
#define MAX_CLIENTS 10

#define SSH_SINGLE_EXEC_TIMEOUT 10000 // 10s

// The HTTPS Server comes in a separate namespace. For easier use, include it here.
using namespace httpsserver;

boolean hp_1_status_req = false;
boolean hp_2_status_req = false;
boolean hp_3_status_req = false;
boolean acer_1_status_req = false;
boolean acer_2_status_req = false;

// Spi for the sd card file system
SPIClass sdSPI(VSPI);

keyValueDatabase<String, String> Session_dict;
URLCode fp_encoded;
WiFiMulti wifiMulti;
SSLCert *cert;
HTTPSServer *secureServer;

const unsigned int configSTACK = 21200;

volatile devState_t devState;
volatile bool gotIpAddr, gotIp6Addr;
volatile bool wifiPhyConnected;

String switch_ssh = "";
String scp_command = "";
String upload_command = "";
String ssh_command = "";
String shh_output_string = "";
String shh_output_send_temp_old = "";

String shh_output_send = "";
String shh_output_send_temp = "";

String getPassword() {
    String text = "";

    const char alphabet[] = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789]X}7:)[Z2T;l58-P6({+";
    size_t alphabetSize = sizeof(alphabet) - 1;
    for (size_t i = 0; i < 32; i++) {
        text += alphabet[esp_random() % alphabetSize];
    }

    return text;
};

// Dynamicly generate an inital value for the password in case the sd card fails to load, so the password is not set to ""
String PASSWORD = getPassword();

// Fan settings
const int PWM_FREQ = 25000; // 25 kHz frequency for computer fans
const int PWM_RESOLUTION = 8;
volatile unsigned long tachPulseCount = 0;
unsigned long lastTachTime = 0;
const unsigned long TACH_SAMPLE_TIME = 1000; // Sample period in milliseconds

// Interrupt service routine for tachometer
void IRAM_ATTR tachISR() {
    tachPulseCount = tachPulseCount + 1;
}

// Declare some handler functions for the various URLs on the server
void handleRoot(HTTPRequest *req, HTTPResponse *res);
void handle404(HTTPRequest *req, HTTPResponse *res);
void handleTerminal(HTTPRequest *req, HTTPResponse *res);
void handleTerminalPost(HTTPRequest *req, HTTPResponse *res);
void handleToggle1(HTTPRequest *req, HTTPResponse *res);
void handleSSHStatus1(HTTPRequest *req, HTTPResponse *res);
void handleToggle2(HTTPRequest *req, HTTPResponse *res);
void handleToggle3(HTTPRequest *req, HTTPResponse *res);
void handleToggle4(HTTPRequest *req, HTTPResponse *res);
void handleToggle5(HTTPRequest *req, HTTPResponse *res);
void handleToggle6(HTTPRequest *req, HTTPResponse *res);
void switchSsh0(HTTPRequest *req, HTTPResponse *res);
void switchSsh1(HTTPRequest *req, HTTPResponse *res);
void handleFan(HTTPRequest *req, HTTPResponse *res);
void handleStyle(HTTPRequest *req, HTTPResponse *res);
void handleComputers(HTTPRequest *req, HTTPResponse *res);
void handleAdmin(HTTPRequest *req, HTTPResponse *res);
void handleLogIn(HTTPRequest *req, HTTPResponse *res);
void handleSSHpage(HTTPRequest *req, HTTPResponse *res);
void handleSCP(HTTPRequest *req, HTTPResponse *res);
void handleUPLOAD(HTTPRequest *req, HTTPResponse *res);

void middlewareAuth(HTTPRequest *req, HTTPResponse *res, std::function<void()> next);

// Websocket SSH handler class
class SSHHandler : public WebsocketHandler {
  public:
    // This method is called by the webserver to instantiate a new handler for each
    // client that connects to the websocket endpoint
    static WebsocketHandler *create();

    // This method is called when a message arrives
    void onMessage(WebsocketInputStreambuf *input);

    // Handler function on connection close
    void onClose();
};

// Websocket for sending fan speed
class FanHandler : public WebsocketHandler {
  public:
    // This method is called by the webserver to instantiate a new handler for each
    // client that connects to the websocket endpoint
    static WebsocketHandler *create();

    // This method is called when a message arrives
    void onMessage(WebsocketInputStreambuf *input);

    // Handler function on connection close
    void onClose();
};

// Simple array to store the active clients:
SSHHandler *activeClients[MAX_CLIENTS];
FanHandler *activeClientsFan[MAX_CLIENTS];
SemaphoreHandle_t clientsMutex = NULL;
SemaphoreHandle_t clientsMutexFan = NULL;

class ssh_conn {
    // All my code :)
  private:
    char *host;
    char *user;
    char *password;
    ssh_channel channel;
    ssh_session session;

  public:
    boolean conn = false;

    ssh_conn(char *host, char *user, char *password) {
        this->host = host;
        this->user = user;
        this->password = password;
    }

    void brutal_exception() {
        if (channel != nullptr) {
            if (ssh_channel_is_open(channel)) {
                ssh_channel_close(channel);
            }
            ssh_channel_free(channel);
            channel = nullptr;
        }
        if (session != nullptr) {
            if (ssh_is_connected(session)) {
                ssh_disconnect(session);
            }
            ssh_free(session);
            ssh_finalize();
            session = nullptr;
        }
    }

