Sandgreenpanda/2026-ESP32/src/main.cpp
        while (remaining > 0) {
            size_t to_read = (remaining < sizeof(buffer)) ? remaining : sizeof(buffer);
            rc = ssh_scp_read(scp, buffer, to_read);
            if (rc == SSH_ERROR) {
                Serial.printf("Error receiving file data: %s\n", ssh_get_error(session));
                targetFile.close();
                ssh_scp_close(scp);
                ssh_scp_free(scp);
                return rc;
            }

            Serial.write((const uint8_t *)buffer, rc);
            targetFile.write((const uint8_t *)buffer, rc);
            remaining -= rc;
        }

        targetFile.flush();
        targetFile.close();

        Serial.printf("Done\n");
        Serial.println();

        rc = ssh_scp_pull_request(scp);
        if (rc != SSH_SCP_REQUEST_EOF) {
            Serial.printf("Unexpected request: %s\n", ssh_get_error(session));
            ssh_scp_close(scp);
            ssh_scp_free(scp);
            return SSH_ERROR;
        }

        ssh_scp_close(scp);
        ssh_scp_free(scp);
        return SSH_OK;
    }
};

std::vector<ssh_conn> ssh_servers = {};

int current_ssh_index = 0;

String FuncReadTemplate(String path, std::initializer_list<std::pair<String, String>> args) {
    String file = SD.open(path, FILE_READ).readString();

    for (const auto &arg : args) {
        file.replace(arg.first, arg.second);
    }

    return file;
}

;

int ex_main() {
    Serial.println("Exec main begin");

    int lastHandleKeepAlive = millis();

    if (ssh_servers[current_ssh_index].connect() != NULL) {
        ssh_servers[current_ssh_index].conn = true;
    }

    Serial.println("loop begin");
    while (1) {

        // Read the ssh data and send it to the websocket clients
        if (!ssh_servers[current_ssh_index].conn || ssh_servers[current_ssh_index].read() < 1) { // Returns rbytes, checks for no-bytes-transferred/error
            // If the connection is down, dont read by short circuit evaluation
            vTaskDelay(1 / portTICK_PERIOD_MS);
        }
        if (switch_ssh != "" && ssh_servers[current_ssh_index].conn) {
            // Disconnect the current ssh session
            ssh_servers[current_ssh_index].brutal_exception();
            // Synchronize the connection status
            ssh_servers[current_ssh_index].conn = false;

            // Switch primary control over to targeted new computer
            current_ssh_index = switch_ssh.toInt();

            if (ssh_servers[current_ssh_index].connect() != NULL) {
                ssh_servers[current_ssh_index].conn = true;
            } else {
                ssh_servers[current_ssh_index].conn = false;
                Serial.println("Disconnected from old server but failed to connect to new server.");
            };

            // Clear variable to prevent infinite loop
            switch_ssh = "";
        } else if (ssh_command != "" && ssh_servers[current_ssh_index].conn) {
            // Write the websocket data to ssh
            ssh_servers[current_ssh_index].write(ssh_command);
            ssh_command = ""; // Reset command to prevent infinite loop
        } else if (upload_command != "" && ssh_servers[current_ssh_index].conn) {
            ssh_servers[current_ssh_index].scp_write(upload_command);
            upload_command = "";
        } else if (scp_command != "" && ssh_servers[current_ssh_index].conn) {
            ssh_servers[current_ssh_index].scp_read(scp_command);
            scp_command = "";
        } else if (hp_1_status_req) {
            String cmd_output = ssh_servers[current_ssh_index].exec_cmd("echo alive");
            cmd_output.trim();
            ssh_servers[current_ssh_index].conn = (cmd_output == "alive");
            Serial.println(cmd_output);
            if (!ssh_servers[current_ssh_index].conn) {
                Serial.println("HP1 Disconnect! Reconnecting...");
                ssh_servers[current_ssh_index].brutal_exception();
                if (ssh_servers[current_ssh_index].connect() != NULL) {
                    ssh_servers[current_ssh_index].conn = true;
                } else {
                    ssh_servers[current_ssh_index].conn = false;
                }
            }
            hp_1_status_req = false;
        } else {
            if (millis() - lastHandleKeepAlive >= 10000 && ssh_servers[current_ssh_index].conn) { // Every 10 seconds
                Serial.println("Keep Alive Check");
                ssh_servers[current_ssh_index].keep_alive();
                lastHandleKeepAlive = millis();
            }
        }
    }
    ssh_servers[current_ssh_index].conn = true;
    ssh_servers[current_ssh_index].disconnect();

    return 0;
}

void controlTask(void *pvParameter) {
    wifiMulti.run();
    Serial.println("Wifi run finished");
    wait_for_wifi_exec(ex_main);
}

void serverTask(void *params) {
    // Server task in different thread on same core for async behavior.
    Serial.println("Creating a new self-signed certificate.");
    Serial.println("This may take up to a minute, so be patient ;-)");

    esp_task_wdt_delete(NULL);

    fs::File crtFile = SD.open("/crypto/server.crt", FILE_READ);
    if (!crtFile) {
        Serial.println("Error: Could not open /crypto/server.crt!");
    }
    String certStr = crtFile.readString();
    crtFile.close();

    fs::File keyFile = SD.open("/crypto/server.key", FILE_READ);
    if (!keyFile) {
        Serial.println("Error: Could not open /crypto/server.key!");
    }
    String keyStr = keyFile.readString();
    keyFile.close();

    cert = new SSLCert(
        (unsigned char *)certStr.c_str(),
        certStr.length() + 1,
        (unsigned char *)keyStr.c_str(),
        keyStr.length() + 1);
    esp_task_wdt_add(NULL);

    secureServer = new HTTPSServer(cert, 443, MAX_CLIENTS);

    ResourceNode *nodeRoot = new ResourceNode("/", "GET", &handleRoot);
    ResourceNode *node404 = new ResourceNode("", "GET", &handle404);
    ResourceNode *nodeTerminal = new ResourceNode("/terminal", "GET", &handleTerminal);
    ResourceNode *nodeTerminalPost = new ResourceNode("/terminal_post", "POST", &handleTerminalPost);
    ResourceNode *nodeToggle1 = new ResourceNode("/toggle1", "POST", &handleToggle1);
    ResourceNode *nodeToggle2 = new ResourceNode("/toggle2", "POST", &handleToggle2);
    ResourceNode *nodeToggle3 = new ResourceNode("/toggle3", "POST", &handleToggle3);
    ResourceNode *nodeToggle4 = new ResourceNode("/toggle4", "POST", &handleToggle4);
    ResourceNode *nodeToggle5 = new ResourceNode("/toggle5", "POST", &handleToggle5);
    ResourceNode *nodeToggle6 = new ResourceNode("/toggle6", "POST", &handleToggle6);
    ResourceNode *nodeSwitchSsh0 = new ResourceNode("/switchssh0", "POST", &switchSsh0);
    ResourceNode *nodeSwitchSsh1 = new ResourceNode("/switchssh1", "POST", &switchSsh1);
    ResourceNode *nodeAdmin = new ResourceNode("/admin", "GET", &handleAdmin);
    ResourceNode *nodeLogIn = new ResourceNode("/admin", "POST", &handleLogIn);

    ResourceNode *nodeHandleFan = new ResourceNode("/fan", "POST", &handleFan);
    ResourceNode *nodeHandleStyle = new ResourceNode("/style.css", "GET", &handleStyle);
    ResourceNode *nodeHandleComputers = new ResourceNode("/computers", "GET", &handleComputers);

    ResourceNode *nodehandleSSHpage = new ResourceNode("/sshpage", "GET", &handleSSHpage);
    ResourceNode *nodeSSHStatus1 = new ResourceNode("/SSH1Status", "POST", &handleSSHStatus1);
    ResourceNode *nodeSCP = new ResourceNode("/scp", "POST", &handleSCP);
    ResourceNode *nodeUPLOAD = new ResourceNode("/upload", "POST", &handleUPLOAD);

    // Websockets
    WebsocketNode *sshNode = new WebsocketNode("/ssh", &SSHHandler::create);
    WebsocketNode *websocketFanNode = new WebsocketNode("/websocketFan", &FanHandler::create);

