Sandgreenpanda/2026-ESP32/src/main.cpp
    // Adding the node to the server works in the same way as for all other nodes
    secureServer->registerNode(sshNode);
    secureServer->registerNode(websocketFanNode);
    secureServer->registerNode(nodehandleSSHpage);

    // Add the root node to the server
    secureServer->registerNode(nodeRoot);
    secureServer->registerNode(nodeSCP);
    // Add the 404 not found node to the server.
    secureServer->setDefaultNode(node404);
    // Add Terminal node
    secureServer->registerNode(nodeTerminal);
    secureServer->registerNode(nodeTerminalPost);
    secureServer->registerNode(nodeSSHStatus1);
    secureServer->registerNode(nodeToggle1);
    secureServer->registerNode(nodeToggle2);
    secureServer->registerNode(nodeToggle3);
    secureServer->registerNode(nodeToggle4);
    secureServer->registerNode(nodeToggle5);
    secureServer->registerNode(nodeToggle6);
    secureServer->registerNode(nodeSwitchSsh0);
    secureServer->registerNode(nodeSwitchSsh1);
    secureServer->registerNode(nodeHandleFan);
    secureServer->registerNode(nodeHandleComputers);

    secureServer->registerNode(nodeAdmin);
    secureServer->registerNode(nodeLogIn);

    secureServer->registerNode(nodeHandleStyle);

    secureServer->registerNode(nodeUPLOAD);

    secureServer->addMiddleware(&middlewareAuth);

    Serial.println("Starting server...");
    secureServer->start();
    if (secureServer->isRunning()) {
        Serial.println("Server ready.");

        while (true) {
            secureServer->loop();
            delay(1);
        }
    }
}

void setup() {
    digitalWrite(LAPTOP_HP_1, LOW);
    digitalWrite(LAPTOP_HP_2, LOW);
    digitalWrite(LAPTOP_HP_3, LOW);
    digitalWrite(LAPTOP_LENOVO_1, LOW);
    digitalWrite(LAPTOP_ACER_1, LOW);
    digitalWrite(LAPTOP_ACER_2, LOW);
    pinMode(LAPTOP_HP_1, OUTPUT);
    pinMode(LAPTOP_HP_2, OUTPUT);
    pinMode(LAPTOP_HP_3, OUTPUT);
    pinMode(LAPTOP_LENOVO_1, OUTPUT);
    pinMode(LAPTOP_ACER_1, OUTPUT);
    pinMode(LAPTOP_ACER_2, OUTPUT);

    // Setup fans
    // First pin is declared to use chanel 0
    ledcSetup(0, PWM_FREQ, PWM_RESOLUTION);
    ledcAttachPin(PWM_FAN_1, 0);
    ledcWrite(0, 0); // Set initial fan speed to zero

    // Configure tachometer pin with interrupt
    pinMode(TACH_FAN_1, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(TACH_FAN_1), tachISR, FALLING);

    // Initialize timing for fan tach
    lastTachTime = millis();

    WiFi.disconnect(true);

    WiFi.setSleep(false);

    wifiMulti.addAP("WC Devices", "0jebr9yrxh");
    wifiMulti.addAP("SPARK-UMRK2N", "NKUWEW7ZZV");

    devState = STATE_NEW;

    Serial.begin(115200);
    clientsMutex = xSemaphoreCreateMutex();
    clientsMutexFan = xSemaphoreCreateMutex();
    if (clientsMutex == NULL) {
        Serial.println("Error: Failed to create clientsMutex!");
    }
    if (clientsMutexFan == NULL) {
        Serial.println("Error: Failed to create clientsMutexFan!");
    }

    sdSPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
    if (!SD.begin(SD_CS, sdSPI)) {
        Serial.println("SD mount failed");
    } else {
        Serial.println("SD mount successful");
    }

    // Begin the session storage
    Session_dict.Open("/data/session.kvdb");

    // Real password is initialed from the SD
    PASSWORD = SD.open("/crypto/password.txt", FILE_READ).readString();

    if (!SD.exists("/data/ssh_settings.csv")) {
        Serial.println("Error: /data/ssh_settings.csv not found!");
    }

    fs::File file = SD.open("/data/ssh_settings.csv", FILE_READ);
    if (!file) {
        Serial.println("Failed to open /data/ssh_settings.csv");
    }

    while (file.available()) {
        String line = file.readStringUntil('\n');
        line.trim();
        if (line.length() == 0)
            continue;

        int firstComma = line.indexOf(',');
        int secondComma = line.indexOf(',', firstComma + 1);

        String ip = line.substring(0, firstComma);
        String user = line.substring(firstComma + 1, secondComma);
        String pass = line.substring(secondComma + 1);

        ip.trim();
        user.trim();
        pass.trim();

        char *host_ptr = const_cast<char *>(strdup(ip.c_str()));
        char *user_ptr = const_cast<char *>(strdup(user.c_str()));
        char *pass_ptr = const_cast<char *>(strdup(pass.c_str()));

        ssh_servers.push_back(ssh_conn(host_ptr, user_ptr, pass_ptr));
    }

    file.close();

    // Initialise the custom wifi event handler, which allows wait_for_wifi_exec to know when the ipv4 and v6 addresses have been set.
    esp_netif_init();
    esp_event_loop_create_default();
    esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, event_cb, NULL, NULL);
    esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, event_cb, NULL, NULL);

    // Stack size needs to be larger, so continue in a new task.

    xTaskCreatePinnedToCore(controlTask, "ctl", configSTACK, NULL, (tskIDLE_PRIORITY + 3), NULL, 0);

    // Make the server async and give it more ram
    xTaskCreatePinnedToCore(serverTask, "https443", 10240, NULL, 1, NULL, ARDUINO_RUNNING_CORE);
}

void loop() {
    delay(1);
    if (millis() - lastTachTime >= TACH_SAMPLE_TIME) {
        // Calculate RPM (2 pulses per revolution for most fans)
        unsigned long rpm = (tachPulseCount * 60000) / (TACH_SAMPLE_TIME * 2);
        Serial.println(rpm);
        tachPulseCount = 0;

        lastTachTime = millis();

        if (clientsMutexFan != NULL && xSemaphoreTake(clientsMutexFan, pdMS_TO_TICKS(100)) == pdTRUE) {
            for (int i = 0; i < MAX_CLIENTS; i++) {
                if (activeClientsFan[i] != nullptr) {
                    activeClientsFan[i]->send(String(rpm).c_str(), WebsocketHandler::SEND_TYPE_TEXT);
                }
            }
            xSemaphoreGive(clientsMutexFan);
        } else {
            Serial.println("Could not acquire lock on fan rpm");
            xSemaphoreGive(clientsMutexFan);
        }
        // Yield
        delay(3);
    };
}

void middlewareAuth(HTTPRequest *req, HTTPResponse *res, std::function<void()> next) {
    Serial.println("MIDDLEWARE HAS STARTED!");
    String user_password_raw = req->getHeader("Cookie").c_str();
    String req_str = req->getRequestString().c_str();
    Serial.println(req_str);
    Serial.println(user_password_raw);

    // Extract the password from the cookie
    String Cookie = user_password_raw.substring(user_password_raw.lastIndexOf("=") + 1, user_password_raw.length());

    Serial.println(Cookie);

    Session_dict.clearErrorFlags();
    String user_password = Session_dict[Cookie.c_str()];
    if (Session_dict.errorFlags()) {
        user_password = "";
    }

    Serial.println("THE NEXT PRINT IS THE USER PASSWORD STRING:");
    Serial.println(user_password);
    Serial.println("THE NEXT PRINT IS THE USER PASSWORD STRING [END]");

    String user_password_trimmed = user_password.substring(user_password.lastIndexOf("=") + 1, user_password.length());

