Sandgreenpanda/2026-ESP32/src/main.cpp
    Serial.println(user_password_trimmed);
    Serial.println(PASSWORD);

    if (user_password_trimmed == PASSWORD || req_str == "/style.css" || req_str == "/admin" || req_str == "/update") {
        if (user_password_trimmed == PASSWORD && req_str == "/admin") {
            res->setHeader("Content-Type", "text/html");
            res->println(FuncReadTemplate("/templates/log_out.html", {{"%LOGGED_IN%", "logout"}}));
        } else {
            next();
        }
    } else {
        res->setStatusCode(404);
        res->setHeader("Content-Type", "text/html");
        res->println(FuncReadTemplate("/templates/admin.html", {{"%LOGGED_IN%", "login"}, {"%ERROR%", "You need to log in to access this page"}}));
    }
}

void handleRoot(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/home.html", {{"%LOGGED_IN%", "logout"}, {"%TIME%", (String)((int)(millis() / 1000))}}));
}

void handleStyle(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/css");
    res->setHeader("Connection", "close");
    res->println(SD.open("/static/style.css", FILE_READ).readString());
};

void handleTerminal(HTTPRequest *req, HTTPResponse *res) {
    // Status code is 200 OK by default.
    // We want to deliver a simple HTML page, so we send a corresponding content type:
    res->setHeader("Connection", "close");
    res->setHeader("Content-Type", "text/html");

    res->println(FuncReadTemplate("/templates/terminal.html", {{"%LOGGED_IN%", "logout"}}));
};

void handleComputers(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/computers.html", {{"%LOGGED_IN%", "logout"}}));
};

WebsocketHandler *FanHandler::create() {
    Serial.println("Creating new chat client!");
    FanHandler *handler = new FanHandler();
    if (clientsMutexFan != NULL && xSemaphoreTake(clientsMutexFan, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            // Yield, to prevent being stuck in a loop
            vTaskDelay(1 / portTICK_PERIOD_MS);

            if (activeClientsFan[i] == nullptr) {
                activeClientsFan[i] = handler;
                break;
            }
        }
        xSemaphoreGive(clientsMutexFan);
    } else {
        Serial.println("Unable to take variable lock");
    }
    Serial.println("Websocket finished");
    return handler; 
}

// When the websocket is closing, we remove the client from the array
void FanHandler::onClose() {
    if (clientsMutexFan != NULL && xSemaphoreTake(clientsMutexFan, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            if (activeClientsFan[i] == this) {
                activeClientsFan[i] = nullptr;
            }
        }
        xSemaphoreGive(clientsMutexFan);
    } else {
        Serial.println("Unable to take variable lock");
    }
}

void FanHandler::onMessage(WebsocketInputStreambuf *inbuf) {
    return;
    // Fan request data is only sent over websocket. This may change in the future.
}

WebsocketHandler *SSHHandler::create() {
    Serial.println("Creating new chat client!");
    SSHHandler *handler = new SSHHandler();
    if (clientsMutex != NULL && xSemaphoreTake(clientsMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            if (activeClients[i] == nullptr) {
                activeClients[i] = handler;
                break;
            }
        }
        xSemaphoreGive(clientsMutex);
    } else {
        Serial.println("Unable to take variable lock");
    }
    return handler;
}

// When the websocket is closing, we remove the client from the array
void SSHHandler::onClose() {
    if (clientsMutex != NULL && xSemaphoreTake(clientsMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            if (activeClients[i] == this) {
                activeClients[i] = nullptr;
            }
        }
        xSemaphoreGive(clientsMutex);
    } else {
        Serial.println("Unable to take variable lock");
    }
}

void SSHHandler::onMessage(WebsocketInputStreambuf *inbuf) {
    if (inbuf == nullptr)
        return;
    // Get the input message
    // Dont know how this works, but I got it from the default websocket chat example
    // Might figure it out later
    std::string msg;
    int ch;
    while ((ch = inbuf->sbumpc()) != EOF) {
        msg.push_back(static_cast<char>(ch));
    }

    String ssh_msg = String(msg.c_str());

    Serial.println("ssh cmd received:");
    Serial.println(ssh_msg);

    ssh_command = ssh_msg;
}

void handleTerminalPost(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/plain");

    // Stream the incoming request body to the response body
    // Theoretically, this should work for every request size.
    byte buffer[256];
    // HTTPReqeust::requestComplete can be used to check whether the
    // body has been parsed completely.
    String shh_input_string = "";
    while (!(req->requestComplete())) {
        // HTTPRequest::readBytes provides access to the request body.
        // It requires a buffer, the max buffer length and it will return
        // the amount of bytes that have been written to the buffer.
        size_t s = req->readBytes(buffer, 256);

        // The response does not only implement the Print interface to
        // write character data to the response but also the write function
        // to write binary data to the response.
        shh_input_string += String(buffer, s);
        // res->write(buffer, s);
    }
    Serial.println(shh_input_string);
    ssh_command = shh_input_string.substring(1, shh_input_string.length() - 1);
    while (ssh_command != "") {
        delay(1);
    }
    res->println(shh_output_string);
    shh_output_string = "";
}

void handleFan(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/plain");
    byte buffer[256];

    String fanSpeedInput = "";
    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);
        fanSpeedInput += String(buffer, s);
    }
    Serial.println("Changing fan speed");
    ledcWrite(0, fanSpeedInput.substring(1, fanSpeedInput.length() - 1).toInt());
    // ledcWrite(0, fanSpeedInput.substring(6).toInt()); // Substring cuts off: speed=
    // Serial.println(fanSpeedInput.substring(6).toInt());
    res->println("OK");
}

void handleSCP(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "application/octet-stream");

    byte buffer[256];

    String filepath = "";
    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);
        filepath += String(buffer, s);
    }
    fp_encoded.urlcode = filepath;
    fp_encoded.urldecode();
    String fp = fp_encoded.strcode;
    scp_command = fp.substring(9, filepath.length());
    Serial.println(scp_command);

    while (scp_command != "") {
        delay(1);
    }

